---
kind: other
id: AllMembers.T:Autodesk.Revit.DB.Form
zh: 对话框、窗口、窗体
source: html/6996b66a-bd53-636c-cba5-5a651b36ab53.htm
---
# Form Members

**中文**: 对话框、窗口、窗体

Add an edge to the form, connecting two edges on same/different profile, by a pair of specified points.